/*************************************************************************
    > File Name: 2_65.c
    > Author: Eric
    > Desc: 检测x中是否有偶数个1. 
			利用异或的特性，相同值异或得0.
			把x的高16位和低16位异或，若两个1在同一个位置上，则结果为0，剩下的就是位置不同的1。以此类推，直到0位，若他们异或结果为1，则说明存在奇数个1，否则存在偶数个1.
    > Created Time: Sun 20 Mar 2016 03:37:35 AM EDT
 ************************************************************************/

#include<stdio.h>

int even_ones(unsigned x)
{
	x ^= x >> 16;
	x ^= x >> 8;
	x ^= x >> 4;
	x ^= x >> 2;
	x ^= x >> 1;
	return !(x & 1);
}

int main()
{
	printf("%d\n", even_ones(0x80000001));
	printf("%d\n", even_ones(0x80000000));
}
